import java.io.IOException;
import java.util.Arrays;
import java.util.List;

public class Program {
    public static void main(String[] args) throws IOException {
        /*
        [    ["5","3",".",".","7",".",".",".","."]
            ,["6",".",".","1","9","5",".",".","."]
            ,[".","9","8",".",".",".",".","6","."]
            ,["8",".",".",".","6",".",".",".","3"]
            ,["4",".",".","8",".","3",".",".","1"]
            ,["7",".",".",".","2",".",".",".","6"]
            ,[".","6",".",".",".",".","2","8","."]
            ,[".",".",".","4","1","9",".",".","5"]
            ,[".",".",".",".","8",".",".","7","9"]]
         */


        //Задание1. Создание объекта типа судоку при помощи конструктора, который считывает данные из файла
        System.out.println("Задание1.");
        Sudoku sudoku = new Sudoku("sudoku.txt");

        // Задание2. Вызов метода, который записывает схему судоку в файл
        System.out.println("Задание2.");
        sudoku.writeToFile("sudokuWrite.txt");


    }
}
